<a href="https://colab.research.google.com/github/srinivasdasu24/__DataScience/blob/main/HR_Analytics/InClass_Working_Code_1_Baseline_Solution_and_first_Submission.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Code 1
- Build Basic Pipeline
- DataFrame Checks
- Group By
- If Then Model
- First Submission
- Import & Export

## 1/ Import Libraries
- Mount Google Drive
- Import Pandas Library

In [ ]:
#CodeSection1
from google.colab import drive
drive.mount('/mntDrive')

Mounted at /mntDrive

In [ ]:
#CodeSection2
import pandas as pd

## 2/ Import Data
- Import Train and Test [use read_csv()]

In [ ]:
/mntDrive/MyDrive/Project MasterMind/1 - Planning Stage/2- Research/6- New Teaching Method/Loan Prediction (Webinar Flow)/Solution Codes/input/

In [ ]:
#CodeSection3
train = pd.read_csv("/mntDrive/MyDrive/__DataScience/3 HR Analytics/input/train.csv")
test = pd.read_csv("/mntDrive/MyDrive/__DataScience/3 HR Analytics/input/test.csv")

### Check Train Data
- Check first 5 rows of train [head(), info()]
- Get Summary Statistics [describe()]
- Check/Identify the "y"/dependent variable

In [ ]:
#CodeSection4
train.head()

   enrollee_id      city  ...  training_hours target
0        23798  city_149  ...             106      0
1        29166   city_83  ...              69      0
2           46   city_16  ...               4      0
3        18527   city_64  ...              26      0
4        21751  city_100  ...              88      1

[5 rows x 14 columns]

In [ ]:
#CodeSection5
train.describe()

        enrollee_id  city_development_index  training_hours        target
count  18359.000000            18359.000000    18359.000000  18359.000000
mean   16729.360096                0.847140       65.899014      0.132088
std     9643.749725                0.110189       60.885300      0.338595
min        1.000000                0.448000        1.000000      0.000000
25%     8378.500000                0.796000       23.000000      0.000000
50%    16706.000000                0.910000       47.000000      0.000000
75%    25148.500000                0.920000       89.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

In [ ]:
#CodeSection6
# Convert/Map Load_Status (Y/N) to  (1/0)
# Only do this step if you have non-numerical label in the "y" variable

In [ ]:
#CodeSection7
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18359 entries, 0 to 18358
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             18359 non-null  int64
 1   city                    18359 non-null  object
 2   city_development_index  18359 non-null  float64
 3   gender                  14261 non-null  object
 4   relevent_experience     18359 non-null  object
 5   enrolled_university     18017 non-null  object
 6   education_level         17902 non-null  object
 7   major_discipline        15521 non-null  object
 8   experience              18300 non-null  object
 9   company_size            13580 non-null  object
 10  company_type            13320 non-null  object
 11  last_new_job            17992 non-null  object
 12  training_hours          18359 non-null  int64
 13  target                  18359 non-null  int64
dtypes: float64(1), int64(3), object(10)
memory usage: 2.0+ MB

### Check Test Data
- Check first 5 rows of test [head(), info()]
- Get Summary Statistics [describe()]
- Check/Identify the "y"/dependent variable

In [ ]:
#CodeSection8
test.head()

   enrollee_id      city  ...  last_new_job training_hours
0        16548   city_33  ...           NaN             15
1        12036   city_28  ...             1             94
2        11061  city_103  ...             1             17
3         5032  city_104  ...             2             76
4        17599   city_77  ...             2             65

[5 rows x 13 columns]

In [ ]:
#CodeSection9
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15021 entries, 0 to 15020
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             15021 non-null  int64
 1   city                    15021 non-null  object
 2   city_development_index  15021 non-null  float64
 3   gender                  11633 non-null  object
 4   relevent_experience     15021 non-null  object
 5   enrolled_university     14742 non-null  object
 6   education_level         14626 non-null  object
 7   major_discipline        12628 non-null  object
 8   experience              14977 non-null  object
 9   company_size            10970 non-null  object
 10  company_type            10691 non-null  object
 11  last_new_job            14717 non-null  object
 12  training_hours          15021 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.5+ MB

In [ ]:
#CodeSection10
test.describe()

        enrollee_id  city_development_index  training_hours
count  15021.000000            15021.000000    15021.000000
mean   16643.004327                0.846683       65.158179
std     9626.895233                0.109709       59.719211
min        6.000000                0.448000        1.000000
25%     8316.000000                0.794000       23.000000
50%    16664.000000                0.910000       47.000000
75%    24908.000000                0.920000       89.000000
max    33378.000000                0.949000      336.000000

## 3/ Explore any one Valuable Variable 
- Identify all the Categorical Features
- Within them choose one feature that helps predict the dependent variable
- Use groupby along with sum() to get the "y" variable by the selected categoical feature
- Use value_counts() to get the total number of rows in each category

In [ ]:
#CodeSection11
# We will use "Married" for this example
# You can select any other variable of your choice
train.groupby('major_discipline').sum()

                  enrollee_id  city_development_index  ...  target  Prediction
major_discipline                                       ...
Arts                  4154590                 215.553  ...      25         150
Business Degree       5208045                 267.576  ...      39         218
Humanities           12155124                 613.805  ...      93         447
No Major              3487323                 178.484  ...      20         155
Other                 6123163                 292.445  ...      37         225
STEM                228501801               11578.876  ...    1877        9792

[6 rows x 5 columns]

In [ ]:
#CodeSection12
# Get count of rows based on each category in your selected Categorical Feature
train['major_discipline'].value_counts()

STEM               13738
Humanities           688
Other                343
Business Degree      307
Arts                 239
No Major             206
Name: major_discipline, dtype: int64

***Note : If the categorical feature has more than 2 values, choose the one with highest probability***

In [ ]:
#CodeSection13
# Now the numbers to get the percentage of that category happening
print(f" Probability of <Category 1> happening: {9792/13738:0.1%}")
print(f" Probability of <Category 2> happening : {447/688:0.1%}")

 Probability of <Category 1> happening: 71.3%
 Probability of <Category 2> happening : 65.0%

### Observation
- Married Applicants have a higher probability of getting a Loan
- use a IF then statement to Predict the "y"/dependent variable
- Use apply(), lambda function on your selected categorical features

In [ ]:
#CodeSection14
train['Prediction'] = train['major_discipline'].apply(lambda x: 1 if x == 'STEM' else 0)

## 4/ Check Accuracy of Model on Train Data
- Check using groupby() and sum() function

In [ ]:
#CodeSection15
train.groupby('major_discipline').sum()

                  enrollee_id  city_development_index  ...  target  Prediction
major_discipline                                       ...
Arts                  4154590                 215.553  ...      25           0
Business Degree       5208045                 267.576  ...      39           0
Humanities           12155124                 613.805  ...      93           0
No Major              3487323                 178.484  ...      20           0
Other                 6123163                 292.445  ...      37           0
STEM                228501801               11578.876  ...    1877       13738

[6 rows x 5 columns]

### We can use a Accuracy Function from Metrics
- Use the sklearn.metrics library
- Within it we will choose the "accuracy_score" function
- We will compare the Actual "y" against the Predicted "y" using the IF THEN model

In [ ]:
#CodeSection16
from sklearn.metrics import accuracy_score

In [ ]:
#CodeSection17
y_actual = train['target']
y_pred = train['Prediction']

In [ ]:
#CodeSection18
print(f" Train Accuracy : {accuracy_score(y_actual, y_pred):0.1%}")

 Train Accuracy : 32.4%

***Q : What accuracy do you observe?***

## 5/ Prediction and Submission
- now lets predict using unseen (test dataset); note test dataset does not have "y" variable
- use apply() and lambda function combo again
- check the prediciton using groupby() and sum()

### Predict

In [ ]:
#CodeSection19
test['Prediction'] = test['major_discipline'].apply(lambda x: 1 if x == 'STEM' else 0)

In [ ]:
#CodeSection20
test.groupby('major_discipline').sum()

                  enrollee_id  ...  Prediction
major_discipline               ...
Arts                  3679004  ...           0
Business Degree       4655482  ...           0
Humanities            9368909  ...           0
No Major              2965564  ...           0
Other                 6047615  ...           0
STEM                183947178  ...       11117

[6 rows x 4 columns]

In [ ]:
#CodeSection21
# We will use (Y/N) to match it to the Competition Submission Data
<Write your code here>

*Use **value_counts()** to check your prediction split*

In [ ]:
#CodeSection21
test['Prediction'].value_counts()

1    11117
0     3904
Name: Prediction, dtype: int64

### Import Sample Submission
- Import the Submission file and check the first 5 rows
- Use read_csv() and head()

In [ ]:
#CodeSection22
sample_submission = pd.read_csv("/mntDrive/MyDrive/__DataScience/3 HR Analytics/input/sample_submission.csv")
sample_submission.head()

   enrollee_id  target
0        16548       0
1        12036       0
2        11061       0
3         5032       0
4        17599       0

### Create a Submission
- Create a Dictionary to attach both the columns
- Convert the Dictionary to Pandas Dataframe [use DataFrame()]

In [ ]:
#CodeSection23
submission = pd.DataFrame({
    'enrollee_id' : test['enrollee_id']   ,
    'target' : test['Prediction']
})

### Export Submission File
- Export to output folder

In [ ]:
#CodeSection24
# Ensure you don't export the index.
submission.to_csv("/mntDrive/MyDrive/__DataScience/3 HR Analytics/output/01_IF_THEN_w.csv", index= False)

In [1]:
# LB Accuracy : 0.51